[ 
"Laugh and the world laughs with you, snore and you sleep alone. - Anthony Burgess",
"Think in the morning. Act in the noon. Eat in the evening. Sleep in the night. - William Blake",
"The nicest thing for me is sleep, then at least I can dream. - Marilyn Monroe",
"I love sleep. My life has the tendency to fall apart when I'm awake, you know? - Ernest Hemingway",
"The best cure for insomnia is to get a lot of sleep. - W. C. Fields",
"The amount of sleep required by the average person is five minutes more. - Wilson Mizener",
"People who say they sleep like a baby usually don't have one. - Leo J. Burke",
"Sleep is the best meditation. - Dalai Lama",
"Sleeping is no mean art: for its sake one must stay awake all day. - Friedrich Nietzsche",
"Sleep: a poor substitute for caffeine! - Wally Shawn",
"Never got to bed mad. Stay up and fight. — Phyllis Diller",
"I feel sorry for people who don't drink. When they wake up in the morning, that’s as good as they’re going to feel all day. — Frank Sinatra",
"No day is so bad it can't be fixed with a nap. - Carrie Snow",
"Life is something that happens when you can't get to sleep. - Fran Lebowitz",
"Consciousness: that annoying time between naps. - Author Unknown",
"A ruffled mind makes a restless pillow. - Charlotte Bronte",
"The best cure for insomnia is a Monday morning. - Author Unknown",
"Fatigue is the best pillow. - Benjamin Franklin",
"I'm not asleep... but that doesn't mean I'm awake. - Author Unknown",
"The last refuge of the insomniac is a sense of superiority to the sleeping world. - Leonard Cohen",
"A day without a nap is like a cupcake without frosting. - Terri Guillemets",
"No matter what time it is, wake me, even if it's in the middle of a Cabinet meeting. - Ronald Reagan",
"Evil in general does not sleep, and therefore doesn't see why anyone else should. - Terry Pratchett",
"We sleep safely at night because rough men stand ready to visit violence on those who would harm us. - Winston S. Churchill",
"Each night, when I go to sleep, I die. And the next morning, when I wake up, I am reborn. - Mahatma Gandhi",
"I think insomnia is a sign that a person is interesting. - Avery Sawyer, Notes to Self",
"Man is a genius when he is dreaming. - Akira Kurosawa",
"Never waste any time you can spend sleeping. - Frank H. Knight"
]
