[ 
"Laugh and the world laughs with you, snore and you sleep alone. - Anthony Burgess",
"Think in the morning. Act in the noon. Eat in the evening. Sleep in the night. - William Blake",
"The nicest thing for me is sleep, then at least I can dream. - Marilyn Monroe",
"I love sleep. My life has the tendency to fall apart when I'm awake, you know? - Ernest Hemingway",
"The best cure for insomnia is to get a lot of sleep. - W. C. Fields",
"The amount of sleep required by the average person is five minutes more. - Wilson Mizener",
"People who say they sleep like a baby usually don't have one. - Leo J. Burke",
"Sleep is the best meditation. - Dalai Lama",
"Sleeping is no mean art: for its sake one must stay awake all day. - Friedrich Nietzsche",
"Sleep: a poor substitute for caffeine! - Wally Shawn",
"Never got to bed mad. Stay up and fight. - Phyllis Diller",
"I feel sorry for people who don't drink. When they wake up in the morning, that's as good as they're going to feel all day. - Frank Sinatra",
"No day is so bad it can't be fixed with a nap. - Carrie Snow",
"Life is something that happens when you can't get to sleep. - Fran Lebowitz",
"Consciousness: that annoying time between naps. - Author Unknown",
"A ruffled mind makes a restless pillow. - Charlotte Bronte",
"The best cure for insomnia is a Monday morning. - Author Unknown",
"Fatigue is the best pillow. - Benjamin Franklin",
"I'm not asleep... but that doesn't mean I'm awake. - Author Unknown",
"The last refuge of the insomniac is a sense of superiority to the sleeping world. - Leonard Cohen",
"A day without a nap is like a cupcake without frosting. - Terri Guillemets",
"No matter what time it is, wake me, even if it's in the middle of a Cabinet meeting. - Ronald Reagan",
"Evil in general does not sleep, and therefore doesn't see why anyone else should. - Terry Pratchett",
"We sleep safely at night because rough men stand ready to visit violence on those who would harm us. - Winston S. Churchill",
"Each night, when I go to sleep, I die. And the next morning, when I wake up, I am reborn. - Mahatma Gandhi",
"I think insomnia is a sign that a person is interesting. - Avery Sawyer, Notes to Self",
"Man is a genius when he is dreaming. - Akira Kurosawa",
"Never waste any time you can spend sleeping. - Frank H. Knight",
"Dear sleep, I know we had problems when I was younger.. but I love you now.",
"I'm so good at sleeping I can do it with my eyes closed.",
"I'm in love with my bed but my alarm clock won't let us be together.",
"I'm great in bed - I can sleep for days.",
"Dear mind, please stop thinking so much at night. I need to sleep.",
"If you can't sleep, then get up and do something instead of lying there worrying. It's the worry that gets you, not the lack of sleep. - Dale Carnegie",
"There is more refreshment and stimulation in a nap, even of the briefest, than in all the alcohol ever distilled. - Edward Lucas",
"A good laugh and a long sleep are the best cures in the doctor's book. - Irish Proverb",
"There is no snooze button on a cat who wants breakfast. - Author Unknown",
"Insomnia is a gross feeder. It will nourish itself on any kind of thinking, including thinking about not thinking. - Clifton Fadiman",
"Dawn: When men of reason go to bed. - Ambrose Bierce",
"If people were meant to pop out of bed, we'd all sleep in toasters. - Author unknown, attributed to Jim Davis",
"Sleep is a symptom of caffeine deprivation. - Author Unknown",
"If a man had as many ideas during the day as he does when he has insomnia, he'd make a fortune. - Griff Niblack",
"There is no hope for a civilization which starts each day to the sound of an alarm clock. - Author Unknown",
"Finish each day before you begin the next, and interpose a solid wall of sleep between the two. - Ralph Waldo Emerson",
"All men whilst they are awake are in one common world: but each of them, when he is asleep, is in a world of his own. - Plutarch",
"Sleep, that deplorable curtailment of the joy of life. - Virginia Woolf",
"Not being able to sleep is terrible. You have the misery of having partied all night... without the satisfaction. - Lynn Johnston",
"Sleep 'til you're hungry, eat 'til you're sleepy. - Author Unknown",
"What hath night to do with sleep? - John Milton",
"Sleep: a poor substitute for caffeine. - Author Unknown",
"The breeze at dawn has secrets to tell you. Do not go back to sleep. - Rumi",
"There are twelve hours in the day, and above fifty in the night. - Marie de Rabutin-Chantal",
"Sleeplessness is a desert without vegetation or inhabitants. - Jessamyn West",
"The feeling of sleepiness when you are not in bed, and can't get there, is the meanest feeling in the world. - Edgar Watson Howe",
"Even where sleep is concerned, too much is a bad thing. - Homer",
"Death, so called, is a thing which makes men weep: And yet a third of Life is passed in sleep. - Lord Byron",
"Living is a disease from which sleep gives us relief eight hours a day. - Chamfort",
"SLEEP - Those little slices of death, how I loathe them. - Edgar Allen Poe",
"The night is the hardest time to be alive and 4am knows all my secrets. - Poppy Z. Brite",
"I've always envied people who sleep easily. Their brains must be cleaner, the floorboards of the skull well swept, all the little monsters closed up in a steamer trunk at the foot of the bed. - David Benioff, City of Thieves",
"I only sleep with people I love, which is why I have insomnia. - Emilie Autumn, The Asylum for Wayward Victorian Girls",
"I've got a bad case of the 3:00 am guilts - you know, when you lie in bed awake and replay all those things you didn't do right? Because, as we all know, nothing solves insomnia like a nice warm glass of regret, depression and self-loathing. - D.D. Barant, Dying Bites", 
"That's the advantage of insomnia. People who go to be early always complain that the night is too short, but for those of us who stay up all night, it can feel as long as a lifetime. You get a lot done - Banana Yoshimoto, N.P.",
"It's a rare book that wins the battle against drooping eyelids. - Tracy Chevalier",
"Sleep is such a luxury, which I can't afford. - Robin Sikarwar",
"O sleep, O gentle sleep, Nature's soft nurse, how have I frightened thee, 1710. That thou no more will weigh my eyelids down, And steep my senses in forgetfulness? - William Shakespeare, Henry IV, Part 2",
"I knew this feeling, the 2 a.m. loneliness that I'd practically invented. - Sarah Dessen, This Lullaby"
]
